<a href="https://colab.research.google.com/github/armandordorica/Advanced-Python/blob/master/web_scraping/Web_scraping_wikipedia_top_10_manufacturers.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
# !pip install wikipedia

In [0]:
# import wikipedia
import pandas as pd
from bs4 import BeautifulSoup
import requests

In [0]:
URL = 'https://en.wikipedia.org/wiki/List_of_largest_manufacturing_companies_by_revenue'
response = requests.get(URL)

In [0]:
soup = BeautifulSoup(response.text, 'html.parser')

In [0]:
table = soup.find('table', {'class': 'wikitable sortable plainrowheads'}).tbody

In [0]:
# print(table)

In [0]:
rows = table.find_all('tr')

In [0]:
columns = [v.text.replace('\n', '') for v in rows[0].find_all('th')]

In [10]:
columns

['No.', 'Company', 'Industry', 'Revenue (by US$ million)', 'Headquarters']

In [0]:
df = pd.DataFrame(columns=columns)

In [14]:
for i in range(1, len(rows)): 
  tds = rows[i].find_all('td')

  if len(tds)==4:
    values = [tds[0].text, tds[1].text, '', tds[2].text, tds[3].text.replace('\n', '').replace('\xa0', '') ]
  
  else:
    values = [td.text.replace('\n', '').replace('\xa0', '') for td in tds]

  df = df.append(pd.Series(values, index = columns), ignore_index=True)

print(df)

    No.                      Company  ... Revenue (by US$ million)    Headquarters
0     1             Volkswagen Group  ...                  288,888         Germany
1     2                 Toyota Group  ...                  265,172           Japan
2     3                        Apple  ...                  229,234   United States
3     4          Samsung Electronics  ...                  211,940     South Korea
4     5                      Daimler  ...                  185,235         Germany
..  ...                          ...  ...                      ...             ...
95   96              GlaxoSmithKline  ...                   38,868  United Kingdom
96   97                  Tyson Foods  ...                   38,260   United States
97   98           Oracle Corporation  ...                   37,728   United States
98   99  Mitsubishi Heavy Industries  ...                   37,103           Japan
99  100                      Fujitsu  ...                   36,991           Japan

[100 rows x 5 columns]

In [0]:
df.to_csv("manufactureTop10.csv")

In [16]:
df

    No.                      Company  ... Revenue (by US$ million)    Headquarters
0     1             Volkswagen Group  ...                  288,888         Germany
1     2                 Toyota Group  ...                  265,172           Japan
2     3                        Apple  ...                  229,234   United States
3     4          Samsung Electronics  ...                  211,940     South Korea
4     5                      Daimler  ...                  185,235         Germany
..  ...                          ...  ...                      ...             ...
95   96              GlaxoSmithKline  ...                   38,868  United Kingdom
96   97                  Tyson Foods  ...                   38,260   United States
97   98           Oracle Corporation  ...                   37,728   United States
98   99  Mitsubishi Heavy Industries  ...                   37,103           Japan
99  100                      Fujitsu  ...                   36,991           Japan

[100 rows x 5 columns]